data_files/HACKATHON_SAMPLE/Sample_XML_2.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
	xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope">
	<SOAP-ENV:Body>
		<ns0:Reversal
			xmlns:ns0="http://www.kotak.com/schemas/CMS_Generic/Reversal_Response.xsd">
			<ns0:Header>
				<ns0:Req_Id>202404011530</ns0:Req_Id>
				<ns0:Msg_Src>DMIUTRREVERSAL</ns0:Msg_Src>
				<ns0:Client_Code>DMIFIN</ns0:Client_Code>
				<ns0:Date_Post>2024-04-01+05:30</ns0:Date_Post>
			</ns0:Header>
			<ns0:Details>
				<ns0:Rev_Detail>
					<ns0:Msg_Id>202404012404</ns0:Msg_Id>
					<ns0:Status_Code>U</ns0:Status_Code>
					<ns0:Status_Desc>Processed</ns0:Status_Desc>
					<ns0:InstRefNo>a1FOS0000054niU2AQ</ns0:InstRefNo>
					<ns0:UTR>FCM-2404019H7CN8</ns0:UTR>
				</ns0:Rev_Detail>
				<ns0:Rev_Detail>
					<ns0:Msg_Id>202404012404</ns0:Msg_Id>
					<ns0:Status_Code>U</ns0:Status_Code>
					<ns0:Status_Desc>Processed</ns0:Status_Desc>
					<ns0:InstRefNo>a1FOS0000054q0P2AQ</ns0:InstRefNo>
					<ns0:UTR>FCM-2404019H7CN7</ns0:UTR>
				</ns0:Rev_Detail>
				<ns0:Rev_Detail>
					<ns0:Msg_Id>202404012404</ns0:Msg_Id>
					<ns0:Status_Code>U</ns0:Status_Code>
					<ns0:Status_Desc>Processed</ns0:Status_Desc>
					<ns0:InstRefNo>a1FOS0000054qgK2AQ</ns0:InstRefNo>
					<ns0:UTR>FCM-2404019H7CN6</ns0:UTR>
				</ns0:Rev_Detail>
				<ns0:Rev_Detail>
					<ns0:Msg_Id>202404012404</ns0:Msg_Id>
					<ns0:Status_Code>U</ns0:Status_Code>
					<ns0:Status_Desc>Processed</ns0:Status_Desc>
					<ns0:InstRefNo>a1FOS0000054t6N2AQ</ns0:InstRefNo>
					<ns0:UTR>FCM-2404019H7CN9</ns0:UTR>
				</ns0:Rev_Detail>
				<ns0:Rev_Detail>
					<ns0:Msg_Id>202404012404</ns0:Msg_Id>
					<ns0:Status_Code>U</ns0:Status_Code>
					<ns0:Status_Desc>Processed</ns0:Status_Desc>
					<ns0:InstRefNo>a1FOS0000054tBD2AY</ns0:InstRefNo>
					<ns0:UTR>FCM-2404019H7CN5</ns0:UTR>
				</ns0:Rev_Detail>
			</ns0:Details>
		</ns0:Reversal>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>